const contentA={
    content0:[
        "5","공지","롯데월드를 서울 잠실에 가야만 볼 수 있다구요?","2021.08.27",
        "6","공지","연간이용 블루권 판매종료 안내","2021.01.22",
        "7","공지","롯데월드 어드벤처 이용 안내(1.18(월)~)","2021.01.16",
          "8","공지","주차시스템 개선 안내","2020.10.01",
        "9","공지","연간이용권 유효기간 추가 연장 안내","2020.04.08"
        
    ],
     content1:[
         
        "10","공지","롯데월드 어드벤처 운영 안내","2021.08.12",
        "11","공지","고객 안내 말씀","2021.08.12",
          "12","공지","로티로리와 함께 하는 캐리와 친구들 댄스파티","2021.07.29",
        "13","공지","월드 카트레이싱 GRAND OPEN","2021.06.10",
         "14","공지","월드모노레일 리뉴얼 진행 안내","2021.03.05"

    ],
     content2:[
        "15","공지","워너비 백설공주의 성 OPEN","2021.05.14",
        "16","공지","국내 최초 6년 연속 실내공기질인증 획득!","2021.05.14",
        "17","공지","코로나19 예방을 위한 롯데월드 어드벤처 종합안내","2021.03.19",
          "18","공지","월드모노레일 리뉴얼 진행 안내","2021.03.05",
        "19","공지","롯데월드 어드벤처 티켓 키오스크 운영 안내","2020.01.08"      

    ]
}
let count=0, tr=0;
$(function(){
    $(".tab2 tr td").on("click",function(){
        no=$(this).index();
        if(no==1) {
           count=0; tr=-1;
            for(k=0; k<6; k++) {
                tr++;
                for(i=0; i<4; i++) {
                    $(".tr"+tr+">td:eq("+i+")").html(contentA.content0[count]);
                    if(count<19)
                        count++;
                    else
                        count=0;
                }
            }
        }
        
        else if(no==2) {
           count=0; tr=-1;
            for(k=0; k<6; k++) {
                tr++;
                for(i=0; i<4; i++) {
                    $(".tr"+tr+">td:eq("+i+")").html(contentA.content1[count]);
                    if(count<19)
                        count++;
                    else
                        count=0;
                       }
            }
        }
         else if(no==3) {
           count=0; tr=-1;
            for(k=0; k<6; k++) {
                tr++;
                for(i=0; i<4; i++) {
                    $(".tr"+tr+">td:eq("+i+")").html(contentA.content2[count]);
                    if(count<19)
                        count++;
                    else
                        count=0;
                       }
            }
        }
    })
})